Revit 2027 API
DuctSettings.AirDynamicViscosity Property
 The dynamic viscosity of air in kg/(ft*s).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AirDynamicViscosity { get; set; }
Public Property AirDynamicViscosity As Double
	Get
	Set
public:
property double AirDynamicViscosity {
	double get ();
	void set (double value);
}
member AirDynamicViscosity : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for airDynamicViscosity must be non-negative.
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace